<unk>
10
11
12
13
14
15
16
17
18
19
20
21
23
22
24
25
26
27
28
29
31
30
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54
55
56
57
58
59
62
63
61
60
64
65
66
67
68
69
70
71
73
72
74
75
77
76
79
81
78
80
82
85
84
86
87
83
88
90
89
92
94
93
91
95
96
97
98
99
100
103
101
102
106
104
105
108
107
110
109
111
112
113
115
114
117
118
116
120
119
123
121
127
126
122
125
124
130
129
128
131
133
134
132
136
135
138
137
139
141
140
144
142
145
143
147
149
146
150
148
151
152
154
153
157
155
156
158
159
160
166
161
163
162
165
167
164
168
169
174
172
171
173
170
175
177
176
178
181
179
183
182
184
180
185
186
188
191
190
189
187
192
196
193
199
198
194
202
200
197
195
206
203
207
204
205
201
208
209
212
210
216
214
211
217
215
213
220
218
225
219
223
222
221
227
229
224
228
226
231
230
235
232
233
234
238
237
236
241
239
240
247
244
243
245
242
250
249
246
252
253
251
255
248
254
257
256
258
260
259
270
262
261
271
265
263
264
266
268
267
272
269
276
279
275
278
274
282
273
277
285
284
281
283
280
289
288
291
287
294
286
290
295
293
292
297
296
304
303
302
300
301
299
298
305
315
311
309
310
313
306
308
318
316
312
314
307
319
322
321
317
324
334
341
326
331
320
327
337
323
330
332
328
329
339
340
344
335
325
343
348
342
333
349
345
338
354
336
346
353
351
352
347
358
362
350
370
367
356
365
361
360
364
357
368
355
373
377
382
359
374
379
366
369
371
363
376
372
383
378
375
389
380
381
385
384
392
393
388
387
386
394
396
395
391
398
406
401
397
399
390
403
417
400
404
413
408
411
445
427
405
402
407
430
410
428
409
438
423
414
446
437
419
426
415
442
421
412
422
429
443
441
431
436
416
452
424
418
425
444
435
439
440
420
450
455
434
451
448
447
497
433
432
482
449
458
466
465
496
453
461
457
469
484
454
474
459
462
468
483
488
492
480
491
472
460
490
467
509
531
463
464
493
486
456
510
515
500
478
487
506
511
473
489
503
481
471
514
513
498
477
535
495
525
479
539
485
516
475
526
533
527
507
505
556
508
499
523
534
512
540
552
504
529
521
494
543
501
520
551
476
517
528
542
537
519
598
470
546
554
518
562
561
502
549
590
557
530
564
600
522
560
538
532
544
545
553
567
547
563
579
595
617
568
524
536
548
631
558
605
555
541
575
559
588
571
592
633
550
566
612
601
569
578
623
584
642
610
565
577
585
606
657
573
583
639
630
607
581
648
620
594
574
629
632
587
640
676
635
616
597
705
609
572
596
589
622
637
636
570
580
586
706
643
621
599
765
654
718
673
651
608
582
613
859
695
611
618
711
641
650
907
665
686
646
634
721
638
627
603
615
625
624
683
644
660
704
663
1224
602
591
689
1012
672
655
733
858
604
674
694
666
1081
746
626
576
669
833
677
628
614
734
803
740
752
645
662
829
619
688
952
1296
732
710
701
716
679
712
691
697
1146
974
938
775
709
783
808
685
708
667
671
929
1199
794
758
820
769
692
1182
745
771
713
659
895
982
678
864
670
690
1149
1269
874
658
945
807
1096
855
1009
916
1208
668
973
763
918
707
1264
1299
1004
836
773
743
941
757
656
661
702
954
700
782
699
1157
1239
1141
728
851
819
723
863
762
781
741
913
957
1087
1161
831
909
693
751
780
1236
861
684
725
1260
990
764
1095
812
647
1178
784
935
1262
777
1132
852
1187
755
1057
1217
747
1148
680
1065
787
1119
1291
903
878
729
930
696
1288
1220
866
985
682
727
1137
1039
1038
1143
703
1023
1074
837
1179
593
795
910
649
888
1162
1117
759
1255
821
978
785
1245
1206
768
901
1251
735
675
825
911
698
917
772
1037
730
1232
1076
925
1156
1231
731
1015
926
1058
1293
1154
811
1066
1135
880
754
1150
715
981
776
882
818
1287
839
1180
959
748
1082
1112
664
1253
1126
996
842
797
1053
827
1031
1265
1115
1173
1207
947
976
1215
850
998
856
816
967
778
906
868
1089
653
1021
869
904
1190
1230
1294
738
796
931
834
1229
750
865
936
854
800
983
1050
862
1093
1218
828
875
1048
756
823
969
1049
1090
986
1160
1130
726
1133
932
1194
1055
1216
1210
1045
1184
766
900
744
881
714
887
1043
886
1240
1226
950
1134
1177
1174
893
792
1139
760
939
789
779
1020
1244
1006
1102
905
652
805
1193
770
720
934
1044
1078
774
1124
1125
1129
848
1104
844
1026
1069
786
971
1072
1249
1099
1056
1172
1116
1295
793
1077
966
923
845
749
722
1275
813
1254
753
1235
949
940
898
1209
798
1027
1158
1272
737
736
1268
687
1189
993
717
810
788
1221
1297
739
809
997
1098
1274
960
1136
1036
1106
884
1033
955
1202
1062
860
1059
879
1142
815
853
1127
870
919
1286
975
912
1008
1060
876
873
1243
965
1007
1067
977
832
1091
890
1169
963
1011
896
928
1196
1163
1054
1041
1248
1165
1145
1261
1213
1276
1201
915
953
719
1061
1140
1079
817
899
1247
1234
1085
1034
681
1030
942
1075
1241
889
1107
1155
1266
1283
885
1222
970
804
822
1170
761
1176
1084
1152
799
883
857
1040
1225
830
840
1111
1197
1092
1025
958
1138
1083
1068
1214
1105
1292
1298
968
1097
951
1123
1277
1042
1205
943
1246
897
1228
872
867
1279
1270
999
1258
724
920
1147
1016
1018
1166
924
1017
914
1153
1242
838
908
1101
1252
1203
1151
922
1108
1188
1192
902
933
979
1131
1003
826
846
1088
1168
961
1094
1029
767
1122
847
1080
1028
1191
843
1024
1005
791
1121
1164
1183
1010
1223
1200
1289
1073
1285
790
944
1257
1263
1013
1002
1144
1159
1103
849
801
991
1109
927
1271
1070
972
995
1282
894
891
1219
1032
1267
802
1212
946
1113
1110
1047
1014
984
992
1064
1022
937
1052
1171
742
1259
841
1281
1001
994
806
1100
1181
988
987
1195
1046
1250
1233
871
1278
1120
1198
1167
835
962
1071
1063
1256
948
1227
877
1237
1114
1273
964
1128
1238
956
1035
1290
1211
892
814
824
1185
989
1280
980
921
1000
1086
1019
1284
9
1175
1051
1204
1118
1186
